# People Report Data

In [6]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
#format: [DB_FLAVOR]+[DB_PYTHON_LIBRARY]://[USERNAME]:[PASSWORD]@[DB_HOST]:[PORT]/[DB_NAME]
engine = create_engine('mysql+mysqlconnector://cnguyen:Imq2MPSzsF5wdd8fBGA@hr-api-production-replica.cdq4e1fn5i6m.ca-central-1.rds.amazonaws.com/humi')

## Digital HR engagement

### the most common digital document types

In [2]:
total = "select count(id), created_at \
from company_documents \
where deleted_at is null \
group by year(created_at)"
pd.read_sql_query(total, con=engine)

   count(id)          created_at
0        387 2018-04-18 19:54:40
1       3154 2019-02-11 18:28:32
2       8217 2020-01-01 17:10:09
3      11999 2021-01-01 03:32:35

In [7]:
covid_19_policies = "select count(id), created_at \
from company_documents \
where deleted_at is null and `name` like '%covid%' \
group by year(created_at)"
pd.read_sql_query(covid_19_policies, con=engine)

   count(id)          created_at
0        258 2020-03-06 16:38:36
1        208 2021-01-03 20:44:12

In [8]:
employee_handbooks = "select count(id), created_at \
from company_documents \
where deleted_at is null and `name` like '%handbook%' and `name` like '%employee%' \
group by year(created_at)"
pd.read_sql_query(employee_handbooks, con=engine)

   count(id)          created_at
0         15 2018-06-15 17:28:16
1         74 2019-01-17 15:14:00
2        176 2020-01-01 17:10:09
3        254 2021-01-01 21:15:42

In [9]:
health_safety = "select count(id), created_at \
from company_documents \
where deleted_at is null and `name` like '%health%' and `name` like '%safety%' \
group by year(created_at)"
pd.read_sql_query(health_safety, con=engine)

   count(id)          created_at
0         10 2018-04-25 14:43:09
1         39 2019-02-02 20:30:39
2         93 2020-01-07 17:57:45
3         99 2021-01-04 18:23:43

In [10]:
confidentiality = "select count(id), created_at \
from company_documents \
where deleted_at is null and `name` like '%confidentiality%' \
group by year(created_at)"
pd.read_sql_query(confidentiality, con=engine)

   count(id)          created_at
0          6 2018-12-18 19:05:48
1         58 2019-07-12 17:37:43
2         96 2020-01-03 03:52:25
3         91 2021-01-03 20:45:05

In [11]:
tax = "select count(id), created_at \
from company_documents \
where deleted_at is null and `name` like '%tax%' \
group by year(created_at)"
pd.read_sql_query(tax, con=engine)

   count(id)          created_at
0         29 2018-04-18 19:54:40
1         75 2019-01-22 17:14:47
2        152 2020-01-02 21:26:15
3        335 2021-01-04 14:54:17

In [12]:
work_from_home = "select count(id), created_at \
from company_documents \
where deleted_at is null and `name` like '%from home%' \
group by year(created_at)"
pd.read_sql_query(work_from_home, con=engine)

   count(id)          created_at
0          8 2019-09-09 14:13:42
1         20 2020-02-11 20:56:56
2         41 2021-01-10 17:41:23

In [13]:
diversity = "select count(id), created_at \
from company_documents \
where deleted_at is null and `name` like '%inclusion%' or `name` like '%diversity%' \
group by year(created_at)"
pd.read_sql_query(diversity, con=engine)

   count(id)          created_at
0          1 2019-06-19 19:10:44
1          5 2020-03-12 16:27:08
2         10 2021-02-22 21:15:34

### # of company use digital document

In [7]:
company_usedocument = "select count(distinct company_id), created_at from company_documents where deleted_at is null group by year(created_at)"
pd.read_sql_query(company_usedocument, con=engine)

   count(distinct company_id)          created_at
0                          86 2018-04-18 19:54:40
1                         354 2019-02-11 18:28:32
2                         653 2020-01-01 17:10:09
3                         977 2021-01-01 03:32:35

### Increased employer use of the ‘digital onboarding experience’

In [12]:
# # of companies having onboarding experience

In [9]:
company_onboarding_query = "select count(distinct company_id), created_at from tasks \
where deleted_at is null and `name` not like '%test%' group by year(created_at)"
pd.read_sql_query(company_onboarding_query, con=engine)

   count(distinct company_id)          created_at
0                         216 2020-11-17 20:03:26
1                         428 2021-03-22 16:17:43

In [8]:
onboarding_query = "select count(id), created_at from tasks \
where deleted_at is null and `name` not like '%test%' group by YEAR(created_at) order by created_at"
pd.read_sql_query(onboarding_query, con=engine)

   count(id)          created_at
0      11074 2020-05-15 18:13:56
1      43852 2021-01-02 21:04:57